{
  "scenarios": [
    {
      "company": "SMC Industries",
      "title": "Silent Attack Ignored by Security Team",
      "summary": "Multiple intrusion attempts went undetected by the company's security team due to lack of visibility and alerting systems.",
      "alerts": [
        "brute_force_login",
        "dns_tunnel",
        "privilege_escalation"
      ],
      "impact": "Active intrusion ongoing for 14 days. Access to internal documents, employee credentials, and finance systems established. Systems appeared healthy due to silent persistence methods.",
      "action_plan": "Upon deployment, CJX Agent performed endpoint scans, revealed dormant malware and rootkits. Threat neutralized, alerting re-enabled, team notified. System logs now monitored with AI-based detection.",
      "report_file": "SMC_Industries_Audit_Report.pdf"
    },
    {
      "company": "Freelancer Laptop",
      "title": "Email Virus Infection from Phishing",
      "summary": "A freelancer opened an email with a hidden executable that quietly installed a remote control agent.",
      "alerts": [
        "malware_injection",
        "unauthorized_access",
        "suspicious_data_transfer"
      ],
      "impact": "The attacker gained full control: installed keylogger, activated webcam, accessed saved credentials. Spreading laterally to nearby unsecured networks.",
      "action_plan": "CJX Agent isolated the laptop, shut down command channels, purged the RAT payload, enabled safe boot protocols and resecured local data vault.",
      "report_file": "Freelancer_Laptop_Audit_Report.pdf"
    },
    {
      "company": "BlueShield Enterprise",
      "title": "Data Leak Despite Strong Perimeter",
      "summary": "A compliant enterprise missed enforcing proper data residency and endpoint patching for one shadow IT asset. A sophisticated actor used this to bypass defenses.",
      "alerts": [
        "external_upload",
        "geo_discrepancy",
        "unusual_transfer_rate"
      ],
      "impact": "1.9GB of employee and vendor data was exfiltrated before being contained. CJX caught the anomaly, traced it to an unmonitored asset.",
      "action_plan": "CJX Agent blocked outgoing traffic, preserved forensic evidence, identified IP trail of attackers, initiated coordinated monitoring and delivered executive-level response report.",
      "report_file": "BlueShield_Enterprise_Audit_Report.pdf"
    }
  ]
}